In [1]:
import pandas as pd

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'age': [25, 30, 35, 40, 29],
    'city': ['São Paulo', 'Rio de Janeiro', 'São Paulo', 'Belo Horizonte', 'Curitiba'],
    'salary': [5000, 7000, 8000, 6000, 7500]
}

df = pd.DataFrame(data)

##### 1. Filtrar pessoas com idade maior que 30 anos

- Use .query() para retornar apenas as pessoas com idade superior a 30.

In [4]:
df.query('age > 30')

      name  age            city  salary
2  Charlie   35       São Paulo    8000
3    David   40  Belo Horizonte    6000

##### 2. Selecionar quem mora em 'São Paulo' e tem salário acima de 6000

- Combine múltiplas condições usando and no .query().

In [6]:
df.query('city == "São Paulo" and salary > 6000')

      name  age       city  salary
2  Charlie   35  São Paulo    8000

##### 3. Filtrar pessoas com salário entre 6000 e 8000 (inclusive)

- Use >= e <= dentro do .query() para filtrar um intervalo de valores.

In [8]:
df.query('salary > 6000 and salary < 8000')

  name  age            city  salary
1  Bob   30  Rio de Janeiro    7000
4  Eva   29        Curitiba    7500

##### 4. Selecionar pessoas cujo nome comece com a letra 'A' ou 'E'

- Lembre-se: .query() não aceita funções como .str.startswith() diretamente. Então, você pode criar uma nova coluna booleana antes, e depois usar o .query() com ela.

In [13]:
df['starts_with_a_or_e'] = df['name'].str.startswith(('A', 'E'))

df['starts_with_a_or_e'] = df['starts_with_a_or_e'].apply(lambda x: 'Sim' if x else 'Não')
df

      name  age            city  salary starts_with_a_or_e
0    Alice   25       São Paulo    5000                Sim
1      Bob   30  Rio de Janeiro    7000                Não
2  Charlie   35       São Paulo    8000                Não
3    David   40  Belo Horizonte    6000                Não
4      Eva   29        Curitiba    7500                Sim

##### 5. Usar variável externa no .query()

- Crie uma variável chamada salario_minimo = 7000 e filtre todos os funcionários com salário acima desse valor usando .query(). ⚠️ Lembre-se de usar o símbolo @ para referenciar a variável externa dentro do query.

In [23]:
mininum_salary = 7000

df.query('salary > @mininum_salary')[['salary', 'name']]

   salary     name
2    8000  Charlie
4    7500      Eva

##### 6. Filtrar pessoas que não moram em 'São Paulo'

- Use o operador != dentro do .query() para excluir.

In [35]:
df.query('~(city == "São Paulo")')

    name  age            city  salary starts_with_a_or_e
1    Bob   30  Rio de Janeiro    7000                Não
3  David   40  Belo Horizonte    6000                Não
4    Eva   29        Curitiba    7500                Sim

##### 7. Selecionar quem tem idade entre 25 e 35, mas não mora em 'Rio de Janeiro'

In [49]:
df.query('(age >= 25 and age <= 35) and ~(city == "Rio de Janeiro") ')

      name  age       city  salary starts_with_a_or_e
0    Alice   25  São Paulo    5000                Sim
2  Charlie   35  São Paulo    8000                Não
4      Eva   29   Curitiba    7500                Sim